# გაყოფა /
# გამრავლება *
# მიმატება +
# გამოკლება -
# სია = list სია არის მონაცემთა სტრუქტურა და სიაში შეგვიძლია ჩავწეროთ თითქმის 
# ყველანაირი სახის მონაცემთა ტიპი
          #0,1,2,3,4
my_list = [1,2,3,4,5] 

list = [1,2,3,4,5,6,7,8,9] # იგი იქმნება ოთკუთხედი ფრჩხილების საშუალებით
list.append(10)
list.append(11) #append ამატებს რიცხვს ბოლოში
print(list)

list2 = [1,2,3,4,5]
list2.clear()  #clear შლის ყველა ელემენტს
print(list2)

list3 = [1,2,3,3,4,5]
count3 = list3.count(3) # ითვლის რამდენჯერაა ქაუნთში მითითებული ელემენტი სიაში
print(count3)

list4 = [1,2,3,4,5,6,7,8,9]
a = list4.index(5) # გამოაქვს მერამდენე ინდექსზე მდებარეობს მითითებული რიცხვი
print(a)

list5 = [1,2,3,4,5]
list5.pop(3) # შლის მითითებულ ინდექსზე მდგომ ელემენტს
list5.remove(2) # remove შლის მითითებულ ელემენტს
print(list5)

list6 = [1,2,3,4,5]
list6.reverse() # reverse არევერსებს
print(list6)