#1) შექმენით რამოდენიმე ცვლადი, მიანიჭეთ რიცხვითი მნიშვნელობები და შეასრულეთ მათემათიკური ოპერაციები.

რამოდენიმე_ცვლადი = 3
რამოდენიმე_ცვლადი1 = 4
რამოდენიმე_ცვლადი2 = 5
რამოდენიმე_ცვლადი3 = 6

print(რამოდენიმე_ცვლადი + რამოდენიმე_ცვლადი1 * რამოდენიმე_ცვლადი2 / რამოდენიმე_ცვლადი2)
print(რამოდენიმე_ცვლადი1 + რამოდენიმე_ცვლადი2 / რამოდენიმე_ცვლადი)
print(რამოდენიმე_ცვლადი2 * რამოდენიმე_ცვლადი3 + რამოდენიმე_ცვლადი2 * რამოდენიმე_ცვლადი3 + რამოდენიმე_ცვლადი + რამოდენიმე_ცვლადი1)


#2) შექმენი ლისტი სახელად list1 და შეასრულე ყველა ახსნილი ოპერცაია append.pop...

list1 = [1,2,3,4,5,6,7,8,9]
list1.append(10)
print(list1)

list2 = [1,2,3,4,5,6,7,8,9]
list2.clear()
print(list2)

list3 = [1,2,3,4,5,6,7,8,9]
a = list3.count(2)
print(a)

list4 = [1,2,3,4,5,6,7,8,9]
b = list4.index(2)
print(b)

list5 = [1,2,3,4,5,6,7,8,9]
list5.remove(2)
print(list5)

list6 = [1,2,3,4,5,6,7,8,9]
list6.pop(2)
print(list6)

list7 = [1,2,3,4,5,6,7,8,9]
list7.reverse()
print(list7)